[
    {
        "id": 1,
        "url": "modern-care",
        "company": "Modern Care",
        "description": "Modern Care is a warm senior care home in Rocklin, California. I worked on this project as part of my web development Philippines work, making sure the website is easy to read and simple to use. Their goal is to give residents comfort, care, and a happy place to live.",
        "website": "https://livemoderncare.com/",
        "image": "modern-care-laptop.png",
        "imageBg": "modern-care-bg.png",
        "responsibilities": "I created the website from scratch using WordPress and Elementor Pro to deliver a compassionate, professional, and user-friendly experience for families seeking senior care solutions. The goal was to create a warm, inviting digital presence that reflects the caring nature of the facility while providing essential information for families making important care decisions. Using Elementor Pro's advanced features, I built custom layouts that showcase the facility's services, created an intuitive navigation system for easy access to care information, and ensured the site was fully optimized for both desktop and mobile devices. The result is a welcoming, accessible website that helps families connect with Modern Care's personalized senior care services.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type": "WordPress",
        "featured_image": [
            "modern-care-1.png"
        ]
    },
    { 
        "id": 2,
        "url": "blue-apple-launchpad",
        "company":"Blue Apple Launchpad",
        "description":"Blue Apple Launchpad is a helpful platform for startups. As part of my website development Philippines projects, I built pages that guide business owners to mentors, investors, and tools they need to grow. The site is designed to be clear and friendly for new entrepreneurs.",
        "website":"https://blueapplelaunchpad.com/",
        "image":"blue-apple-laptop.png",
        "imageBg": "blueapple-bg.jpg",
        "responsibilities":"I created the website from scratch using WordPress and Elementor Pro to deliver a dynamic, responsive, and professional user experience. The goal was to provide entrepreneurs with a sleek, functional space to showcase their businesses and attract investment. Using Elementor Pro’s drag-and-drop features, I built custom layouts, added interactive elements, and ensured the site was fully optimized for both desktop and mobile. The result is an intuitive platform that helps startups thrive by offering visibility and facilitating valuable connections.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "blueapple.png"
        ]
    },
    { 
        "id": 3,
        "url": "monster-quest-escape-room",
        "company":"Monster Quest Escape Room",
        "description":"Monster Quest Escape Room is an exciting game where teams solve puzzles, find clues, and escape themed rooms. As a web developer Philippines, I helped create a website that shows the fun and adventure of the experience in a simple and engaging way.",
        "website":"https://monsterquestescaperoom.com/",
        "image":"monster-quest-laptop.png",
        "imageBg": "monster-quest-bg.webp",
        "responsibilities":"I designed and developed the website from the ground up using WordPress and Elementor Pro to craft an engaging, interactive, and user-friendly experience with a touch of medieval flair. The focus was on creating a fully immersive platform that transports visitors into the heart of each escape room adventure. Leveraging Elementor Pro’s advanced tools, I built custom layouts inspired by medieval aesthetics, integrated dynamic elements like castle-themed graphics and parchment-style backgrounds, and ensured seamless performance across devices. The final product is a visually striking, responsive website that captures the excitement of the escape room experience while evoking the mystery and grandeur of a medieval quest, complete with clear navigation and streamlined booking functionality.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "monster-quest.png"
        ]
    },
    { 
        "id": 4,
        "url": "asticom-group-of-companies",
        "company":"Asticom Group of Companies",
        "description":"Asticom Group of Companies is a Philippine-based shared services company that provides staffing and tech solutions that empower businesses towards meaningful growth.",
        "website":"https://asticom.com.ph/",
        "image":"asti-laptop.png",
        "imageBg": "asti-bg.png",
        "responsibilities":"A sleek and professional company website showcasing innovative services, built with WordPress and enhanced using Elementor Pro for dynamic functionality. I served as the main developer in transforming this website, aiming to overhaul the previous version into a completely refreshed design that aligns with the company's new branding. The layout, crafted by our marketing and UI/UX teams, was then turned into a functional website by me.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "ati-1.png"
        ]
    },
    { 
        "id": 5,
        "url": "champions-club-texas",
        "company":"Champions Club texas",
        "description":"Champions Club Texas is defining the new standard for poker clubs in Houston. Their luxurious poker room offers a world-class experience that starts as you enter the gaming room.",
        "website":"https://championsclubtexas.com/",
        "image":"championsclub-laptop.png",
        "imageBg": "champions-bg.webp",
        "responsibilities":"A casino website created with WordPress and Elementor Pro, delivering captivating design and seamless functionality. This website is among my freelance projects and marks my first venture with a US client. It was successfully launched through a collaborative effort between a graphic designer and a web developer.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "championclub.png"
        ]
    },
    { 
        "id": 6,
        "url": "escape-in-time",
        "company":"Escape In Time",
        "description":"Escape In Time is a distinctive platform offering immersive, interactive escape room experiences. Whether in-person or virtual, it allows participants to engage in thrilling puzzles, captivating storylines, and team challenges designed for all skill levels.",
        "website":"https://escapeintime.org/",
        "image":"escape-in-time-laptop.png",
        "imageBg": "escape-in-time-bg.jpg",
        "responsibilities":"As the developer, I created the website from scratch using WordPress and Elementor Pro, ensuring a highly interactive, visually engaging, and responsive experience for visitors. The goal was to create a dynamic, easy-to-navigate site that would showcase Escape in Time’s diverse range of immersive escape room experiences, providing an intuitive interface for users to explore different themes, book sessions, and learn more about the company. Leveraging Elementor Pro’s advanced drag-and-drop functionality, I designed custom layouts, integrated multimedia elements like videos and animations, and ensured the site was fully optimized for seamless use across desktop and mobile devices. The result is a captivating, user-friendly website that reflects the adventure-filled essence of Escape in Time, making it easy for users to book their experiences, get information, and stay engaged with the brand.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "escape-in-time-1.png"
        ]
    },
    { 
        "id": 7,
        "url": "baby-company",
        "company":"Baby Company",
        "description":"A polished website crafted from PSD to HTML, featuring seamless transitions and responsive design for optimal user experience and engagement.",
        "website":"https://inancelis.com/baby-company/",
        "image":"baby-company-laptop.png",
        "imageBg": "baby-company-bg.png",
        "responsibilities":"This was part of my journey on my first job search, the developer from this company assigned to me a task which I need to convert the layout from their mockup which is PSD to a fully designed and responsive website.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery"
        ],
        "type":"PSD to Html",
        "featured_image": [
            "baby-company.png"
        ]
    }, 
    { 
        "id": 8,
        "url": "hols-kitchen",
        "company":"Hols Kitchen POS System",
        "description":"Hols Kitchen is a small restaurant business that has been developed using the Java programming language. The system was created using the Java NetBeans Integrated Development Environment (IDE) and utilizes a MySQL database for data storage.",
        "website":"",
        "image":"baby-company-laptop.png",
        "imageBg": "hols.webp",
        "responsibilities":"",
        "tools": [
            "Java",
            "Netbeans",
            "MYSQL Database"
        ],
        "type":"Java",
        "featured_image": [
            "hols-1.png",
            "hols-2.png",
            "hols-3.png",
            "hols-4.png",
            "hols-5.png",
            "hols-6.png",
            "hols-7.png",
            "hols-8.png",
            "hols-9.png",
            "hols-10.png",
            "hols-11.png",
            "hols-12.png",
            "hols-13.png",
            "hols-14.png",
            "hols-15.png",
            "hols-16.png",
            "hols-17.png",
            "hols-18.png",
            "hols-19.png"
        ]
    },
    { 
        "id": 9,
        "url": "acquiro-website",
        "company":"Aquiro Website",
        "description":"Acquiro is an end-to-end workforce solutions company that connects top talents and businesses of all sizes through their advanced tech platform.",
        "website":"https://acquiro.com.ph/",
        "image":"baby-company-laptop.png",
        "imageBg": "acquiro.jpg",
        "responsibilities":"We built this website from the ground up, frequently engaging in planning and brainstorming sessions throughout the development process. As the primary developer of this website, I collaborated extensively with the marketing and UI/UX teams to ensure we met all client requirements, deadlines and expectations.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "acquiro.png"
        ]
    },
    { 
        "id": 10,
        "url": "absi-website",
        "company":"ABSI Website",
        "description":"ABSI is a business process and IT solutions provider under the subsidiary of Asticom Technology Inc. They are committed to helping their clients grow through innovative solutions, and unmatched expertise.",
        "website":"https://absi.ph/",
        "image":"baby-company-laptop.png",
        "imageBg": "absi.png",
        "responsibilities":"The website has been totally revamped with a new look and updated version. As the primary developer of this website, I collaborated extensively with the marketing and UI/UX teams to ensure we met all client requirements, deadlines and expectations.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "absi-1.png"
        ]
    },
    { 
        "id": 11,
        "url": "finsi-website",
        "company":"Finsi Website",
        "description":"FINSI provides innovative engineering solutions to businesses in the Telecommunications, Energy and Infrastructure industries.",
        "website":"https://finsi.com.ph/",
        "image":"baby-company-laptop.png",
        "imageBg": "finsi.jpg",
        "responsibilities":"As the primary developer of this website, I collaborated extensively with the marketing and UI/UX teams to ensure we met all client requirements, deadlines and expectations.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery",
            "WordPress / Elementor Pro",
            "PHP"
        ],
        "type":"WordPress",
        "featured_image": [
            "finsi.png"
        ]
    },
    { 
        "id": 12,
        "url": "the-champions-club",
        "company":"The Champions Shop",
        "description":"The Champions Shop made from Laravel Framework a website dedicated marketplace specifically designed for players of the popular game Lords Mobile. It provides a platform where gamers can not only sell their accounts but also post comprehensive information about their accounts, including achievements, character levels, and other relevant details. This enables other players to make informed decisions when considering purchasing an account.",
        "website":"https://rajtheone.com/",
        "image":"baby-company-laptop.png",
        "imageBg": "rajtheone.jpg",
        "responsibilities":"",
        "tools": [
            "HTML",
            "CSS / SASS",
            "JavaScript / JQuery",
            "PHP / Laravel Framework"
        ],
        "type":"Laravel",
        "featured_image": [
            "rajtheone-1.png",
            "rajtheone-2.png",
            "rajtheone-3.png",
            "rajtheone-4.png",
            "rajtheone-5.png",
            "rajtheone-6.png",
            "rajtheone-7.png",
            "rajtheone-8.png",
            "rajtheone-9.png",
            "rajtheone-10.png",
            "rajtheone-11.png",
            "rajtheone-12.png",
            "rajtheone-13.png"

        ]
    },
    { 
        "id": 13,
        "url": "jhola",
        "company":"Jhola",
        "description":"Jhola is an Amazon agency, one if just a few groups of world-class specialist who've built their entire careers around helping clients succeed in the ultracompetitve world of Amazon marketing.",
        "website":"",
        "image":"baby-company-laptop.png",
        "imageBg": "jhola.jpg",
        "responsibilities":"Jhola was a project I worked on as a freelancer, where I transformed a PSD mockup design into a fully functional website that was an exact replica of the original design.",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery"
        ],
        "type":"PSD to Html",
        "featured_image": [
            "jhola-1.png",
            "jhola-2.png"
        ]
    },
    { 
        "id": 14,
        "url": "reefic-protocol",
        "company":"Reefic Protocol",
        "description":"Reefic protocol is a decentralised platform where customers can exchange reward points accross multiple loyalty programs and selected cryptocurrencies.",
        "website":"",
        "image":"baby-company-laptop.png",
        "imageBg": "reefic.webp",
        "responsibilities":"",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery"
        ],
        "type":"PSD to Html",
        "featured_image": [
            "reefic.jpg"
        ]
    },
    { 
        "id": 15,
        "url": "random-project",
        "company":"Random Project",
        "description":"This project involved creating a modern website design as part of my freelance portfolio. A friend referred the client to me, and the scope of my work was specifically to transform a PSD mockup design into a fully functional HTML file. This task required careful attention to detail to ensure that every element of the original design was accurately reflected in the web version.",
        "website":"",
        "image":"baby-company-laptop.png",
        "imageBg": "random.png",
        "responsibilities":"",
        "tools": [
            "HTML",
            "CSS",
            "JavaScript / JQuery"
        ],
        "type":"PSD to Html",
        "featured_image": [
            "project-1.png"
        ]
    }
]